export default () =>
  `Чтобы пользоваться ботом напиши команду "расписание", а затем укажи группу, подгруппу и число
  Например: "Расписание испк-18-1 первой подгруппы на среду
  Или так: "Замены дак-18-1 второй подгруппы на 5 марта"
  Если для пары есть замен, то рядом с ней будет значок карандаша ✏
  Этот бот не является официальным, а разработчик никак не связан с МпК, МГТУ, и тайным правительством
  Расписание и замены автоматически скачиваются с http://newlms.magtu.ru
  Если что то не работает пиши сюда https://vk.com/ivanik7`;
